<script setup>
    import {inject} from 'vue';

    const chars = inject('chars');
    const chats = inject('chats');


    chars.value = {
        "818b84be-59cb-4f48-bbd4-0742a0865887": {"name": "琴柳", "avatar": "/avatar/琴柳.png"},
        "adcb4d66-0fa8-43e3-ad6b-56e888629f3c": {"name": "缄默德克萨斯", "avatar": "/avatar/缄默德克萨斯.png", "right": true}
    };
    chats.value = [{
        "char": "",
        "content": "这是一段测试文本",
        "type": "chat",
        "id": "5f6bf866-6c2c-48c1-a3ba-bdfdba7645ad"
    }, {
        "char": "818b84be-59cb-4f48-bbd4-0742a0865887",
        "content": "左短对话",
        "type": "chat",
        "id": "9231797b-afc0-44f9-8139-f038dd50ea36"
    }, {
        "char": "adcb4d66-0fa8-43e3-ad6b-56e888629f3c",
        "content": "右长对话" +
            "\n对德克萨斯来说，乔万娜与拉普兰德，分别代表了她在哥伦比亚与叙拉古的过去。" +
            "\n或者更进一步，如果没有发生七年前的事，她可能会成为一个沉默寡言的拉普兰德，也可能成为一个杀伐果断的乔万娜。" +
            "\n拉普兰德意味着对叙拉古的歇斯底里，她无法面对，却也无处可去。" +
            "\n而乔万娜则是对哥伦比亚的迷惘，她知道可以不这么做，却不知道自己可以怎么做。" +
            "\n德克萨斯其实知道，如果自己没有逃离那一切，她也会走上和她们相似的道路。" +
            "\n因此，当拉普兰德出现在她面前，当她不得不面对乔万娜时，她在感到怀念的同时，心生愧疚。" +
            "\n所以她会容忍拉普兰德的种种行为，也想要去承受乔万娜的责难，无他，即便她再怎么排斥属于家族的一切，" +
            "她终究姓德克萨斯，她生长在这种文化之中，这是永远无法洗去的烙印。" +
            "\n当她终于决定离开这一切的同时，她也知道自己付出了怎样的代价。\n值得吗？" +
            "\n她不断地反问自己这个问题，理所当然地，她无法得出答案。" +
            "\n离开哥伦比亚与叙拉古后，她只能急切地寻找着一种能够代替过去生活的新生活。" +
            "\n对她来说，一种生活中并不存在值得追寻的意义，值得追寻的是生活本身。\n幸好，她找到了。",
        "type": "chat",
        "id": "2320b35a-fedc-4eee-95aa-c26b8e21d055"
    }, {
        "char": "adcb4d66-0fa8-43e3-ad6b-56e888629f3c",
        "content": "反向内心",
        "type": "monologue",
        "id": "ea822194-c55d-4dc7-93eb-b0c629d32dec",
        "opposite": true
    }]
</script>

<template></template>